RuthuShetty/AAHAR/firmware-probe/sdkconfig.defaults
# AAHAR Silage Probe — ESP-IDF SDK Configuration Defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_FREERTOS_HZ=1000

# Power Management & Ultra Low Power RTC
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y

# Bluetooth 5.0 (BLE relay mode)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
